
// для того чтобы сделать цикл используем пример ниже:
// так же можно ипользовать условные операторы в нутри циклов.
 
// назначаем            условие          поведение  
// пеменную             завершения       перемменой во время 
// для цикла:           цикла:           цикла:
// for(var i = 0;          i <= 10;         i += 2) {
//     console.log(i)
// };


// exapmle for work with array 👇👇👇👇👇👇👇👇👇👇👇👇👇👇👇👇

// var arr = new Array("string", 5, 6.8, -47, false, -1.9, true, "&&", "!")

// for (var i = 0; i < arr.length; i++) {
//     console.log( i  + ": " + arr[i])  
// };


// for while👇👇👇👇👇👇👇👇👇👇👇

// var matrix = [
//     ["string", 5, 6.8], [6.8, -47], "Hai!!!", [-47, false, -1.9], [true, "Hello", "!"]
// ],

// i = 0;   
// while (i < matrix.length) {
//     console.log(i + ": " + matrix[i])
//     i++
// };


// for do_while👇👇👇👇👇👇👇👇👇👇👇👇👇

// const x = new Array(555, 4.938, [748, true], "string", false, [false, true, true]);

// var i = 0;
// do {
//     console.log(i + ": " + x[i]);
//     i++
// } while (i < x.length);